provisioning/network/img/network-boot-state.mermaid
---
title: Network Boot State Diagram
---
stateDiagram-v2
  direction LR
  [*] --> UEFI
  UEFI --> PXE
  PXE --> iPXE
  iPXE --> Image
  Image --> [*]
